app/views/category_jobs/_index.html.erb

    <div class = "flex inline-flex grid grid-cols-3 pl-32 bg-gray-100 w-screen">
      <% CategoryJob.all.each do |job| %>
---
SELECT "category_jobs".* FROM "category_jobs"