app/controllers/category_jobs_controller.rb

SELECT "category_jobs".* FROM "category_jobs"
---
    def _index
        @category_jobs = CategoryJob.all

INSERT INTO "category_jobs" ("category_name", "category_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_name", "adadad"], ["category_description", "adadadada"], ["created_at", "2021-09-05 00:08:10.156385"], ["updated_at", "2021-09-05 00:08:10.156385"]]
---
    def create
        @category_job = CategoryJob.new(category_jobs_params)
        if @category_job.save