app/controllers/home_controller.rb

  def index
    @category_job = CategoryJob.all
---
SELECT "category_jobs".* FROM "category_jobs"