app/controllers/job_offers_controller.rb

    def index
        @job_offer = JobOffer.where(category_job_id: params[:id])
---
SELECT "job_offers".* FROM "job_offers" WHERE "job_offers"."category_job_id" = $1 LIMIT $2  [["category_job_id", 18], ["LIMIT", 1]]